Trabalho_4/simulation/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../paramDict" 

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ($Ui 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    side1
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    side2
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    walls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
