Trabalho_4/simulation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../paramDict"

convertToMeters 1;


vertices
(
    (0.0    0.0 0)      //0
    ($L     0.0 0)
    ($L     0.0 0)      //2
    (0.0    0.0 0)

    (0.0    $minY $z)   //4
    ($L     $minY $z)
    ($L     $y    $z)      //6
    (0.0    $y    $z)

);

blocks
(
    // inlet block
    hex (0 1 2 3  4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
    arc 4 7 (0  0 $r)
    arc 5 6 ($L 0 $r)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    side1
    {
        type cyclicAMI;
        neighbourPatch side2;
        faces
        (
            (0 1 5 4)
        );

        transformType rotational;
        rotationAxis (1 0 0);
        rotationCentre (0 0 0);
    }

    side2
    {
        type cyclicAMI;
        neighbourPatch side1;
        faces
        (
            (7 6 2 3)
        );

        transformType rotational;
        rotationAxis (1 0 0);
        rotationCentre (0 0 0);
    }

    walls
    {
        type wall;
        faces
        (
            (4 5 6 7)
            (3 2 1 0)
        );
    }
);


// ************************************************************************* //
